{
    "installer home": [
        "Welcome back to Pycraft's Setup Wizard, we have detected you already have an install of Pycraft on your system, this gives you 3 available options.\n\nWould you like to update, modify or uninstall your version of Pycraft?\n\nThis will modify the installation of Pycraft at: {}",
        "We did not receive permission to download files from the internet and modify files on this PC, as a result we cannot install Pycraft, would you like to amend this decision (yes) or close the installer (no)?",
        "Welcome to Pycraft's Setup Wizard, here we will guide you through your install and setup of the latest stable version of Pycraft, if you wish to install the BETA versions of the game, please tick the box below and then once you are satisfied with your choice, please press the continue button, you can press the back button to navigate to the previous menu or choose to exit Pycraft's Setup Wizard by closing the GUI.\n\nThere are a few steps to this install but this shouldn't take long.",
        "Welcome to Pycraft's Setup Wizard, here we will guide you through your install and setup of the latest stable version of Pycraft, if you wish to install the BETA versions of the game, please tick the box below and then once you are satisfied with your choice, please press the continue button, you can press the back button to navigate to the previous menu or choose to exit Pycraft's Setup Wizard by closing the GUI.\n\nThere are a few steps to this install but this shouldn't take long.\n\nIn order to install Pycraft you will need to have a suitable version of Python installed on your system, ideally this needs to be 3.7 or greater -with version checking coming in a later version-. If you want to install Pycraft stand-alone then on the releases page of the project (here: https://github.com/PycraftDeveloper/Pycraft/releases) please download the (.exe) version.",
        "Welcome to Pycraft's Setup Wizard, here we will guide you through your install and setup of the latest stable version of Pycraft, if you wish to install the BETA versions of the game, please tick the box below and then once you are satisfied with your choice, please press the continue button, you can press the back button to navigate to the previous menu or choose to exit Pycraft's Setup Wizard by closing the GUI.\n\nThere are a few steps to this install but this shouldn't take long.\n\nCurrently this installer is Windows only, but more OS's will be supported in later editions"
    ],

    "install": [
        "Please read the below information, once you have familiarized yourself with the information, please tick the box to say that you have and then press continue to start the installation. Use the scroll wheel to scroll the text.\n\nYou can find Pycraft's GitHub repository here for more information: https://github.com/PycraftDeveloper/Pycraft\n\nThe program will be updated frequently and I shall do my best to keep this up to date too. I also want to add that you are welcome to view and change the program and share it with your friends. If you find any bugs or errors, please feel free to comment in the comments section any feedback so we can improve our program, it will all be much appreciated and give as much detail as you wish to give out. \n\n\nLicence\nMIT License\n\nCopyright (c) 2021 Thomas Jebbo\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.",
        "Now we need to ask one final thing before we start the install, where would you like to store Pycraft?",
        "Can we have permission to download files from the internet and also modify files on this PC at any time using this Installer?",
        "\nDownloading {}. This may take a moment",
        "We did not receive permission to download files from the internet and modify files on this PC, as a result we cannot install Pycraft, would you like to amend this decision (yes) or close the installer (no)?",
        "Can we have permission to download files from the internet and also modify files on this PC at any time using this Installer?",
        "Successfully installed {} we hope that you enjoy using this project. This installer can be opened from Pycraft by clicking on the 'Installer' option on the main menu. The installer will appear differently when you open it from Pycraft, from there you will be able to change these settings again under the 'Modify' section, but you also have the option to 'Repair', 'Uninstall' and 'Update' Pycraft. For now though we have finished the install but we have some final options which will be applied when the GUI closes:\nDo you want to add Pycraft to the desktop?\nAdditionally do you want to add Pycraft to the start (recommended)?\nYou also have the option to view the release notes for this install as well.\nThanks for installing Pycraft!",
        "You need to run this program as an administrator to be able to use this function",
        "Pycraft has successfully installed but some of your final configurations have not been made, this will change in later versions of Pycraft but a quick fix is trying to restart the installer, files downloaded already will be automatically skipped in the download and install. Also this is an early version of the installer, small issues like this will be fixed in later versions of Pycraft that are build around the installer.\n\nFull error message: {}"
    ],

    "update": [
        "Welcome to Pycraft's update utility, here we will uninstall all of Pycraft's files as well as its additional data with the exception of your saved data, then reinstall the latest version.\nThe update utility will prompt for both accessing and downloading files from the internet and for the manipulation and removal of some of your files.\n\nIf an update is available then you can continue through the update utility, if not then you can return back to the 'Modify Your Install' screen.\n\n",
        "Can we have permission to download files from the internet and also modify files on this PC during the update process?",
        "We did not receive permission to download files from the internet and modify files on this PC, as a result we cannot install Pycraft, would you like to amend this decision (yes) or quit the installer (no)?",
        "Can we have permission to download files from the internet and also modify files on this PC at any time using this Installer?",
        "\nChecking for updates online. (This might take a bit of time to complete)",
        "\nThere are updates available on this PC, press 'continue' to start the update",
        "Pycraft has successfully updated to the latest version. Running Pycraft now will automatically run the latest version.\n\nThis is a new feature so might cause some saved data to be lost whilst the project features changes to how it stores saved data.\nWe hope you enjoy using the latest update, feel free to leave feedback and view the changes on GitHub!"
    ],

    "uninstall": [
        "You have arrived at Pycraft's uninstall utility, here you can remove Pycraft from your system and/or remove the project's additional files, these will be sent to your recycle bin so you have the option to change your mind.\n\nIf you want to feel free to feedback any bugs, ideas or suggestions to the developers who's contact you can find here: https://github.com/PycraftDeveloper/Pycraft",
        "Please now take the time to make sure you have chosen correctly as some options will clear all settings and progress made! \n\nPress OK to continue the uninstall process",
        "We did not receive permission to remove and modify files on this PC, as a result we cannot uninstall Pycraft, would you like to amend this decision (yes) or close the installer (no)?",
        "Pycraft has been removed from your computer, you can re-install the project at any time from GitHub, SourceForge or PyPi. If you have experienced any bugs or have any suggestions then feel free to share them on the project page!"
    ],

    "repair": null
}